
* HIRES extraction routines

These routines extract velocity-calibrated 2D spectra of each emission line. 

We start with:

1. 2D Keck HIRES slit spectral images (FITS files). 
2. The location on the chip of the spectrograph orders (provided as a DS9 region file).
3. A wavelength calibration for the entire image (FITS image of wavelength of each pixel).
4. A list of the emission lines of interest with their rest wavelengths


** Extracting and pixel-rectifying the orders

#+BEGIN_SRC sh :results output
python extract-orders.py --help
#+END_SRC

#+RESULTS:
#+begin_example
usage: extract-orders.py [-h] [--outdir OUTDIR] specfile wavfile regionfile

Extract individual spectral orders from a Keck HIRES image

positional arguments:
  specfile              Name of spectral image FITS file (sans extension)
  wavfile               Name of wavelength FITS file (sans extension)
  regionfile            Name of DS9 region file containing orders (sans
                        extension)

optional arguments:
  -h, --help            show this help message and exit
  --outdir OUTDIR, -o OUTDIR
                        Directory for placing the results (default: Extract)
#+end_example

** Design notes

*** Finding the orders to extract

+ We have our boxes, and then we have the calibrated pixel regions. 
+ The problem with the boxes is that they overlap
  + Possible solution: thin them down so they are just the central part of the slit in each order
  + This did work just about
